driver-tests/httpsoapbc/JavaEE_vs_BC/SoapOneWayIn_JBI/test/2ejb_Encoded/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://j2ee.netbeans.org/wsdl/SoapFeeder4SoapOneWayIn" xmlns:typ="http://xml.netbeans.org/schema/TypeSchema">
  <soapenv:Body>
    <soap:SoapFeeder4SoapOneWayInOperation_Encoded>
      <part1>
        <typ:request>input data for testcase "2ejb_Encoded"</typ:request>
      </part1>
    </soap:SoapFeeder4SoapOneWayInOperation_Encoded>
  </soapenv:Body>
</soapenv:Envelope>